//// گرفتن ورودی به صورت یک خطی 
//string[] input = Console.ReadLine().Split(' ');
//// تعریف متغیرها از ورودی گرفته شده
//int a = int.Parse(input[0]); 
//int b = int.Parse(input[1]);
////تعریف دو لیست جهت ریختن مقسوم علیه های دو عدد داده شده
//List<int> resultA = new List<int>();
//List<int> resultB = new List<int>();

//// بررسی اینکه اگر باقیمانده برابر صفر شد، یعنی عدد مذکور مقسوم علیه درستی بوده و در نتیجه داخل لبست اولی ریخته میشود
//for (int i = 1; i <= a; i++)
//{
//    if (a % i == 0)
//    {
//        resultA.Add(i);
//    }
//    else
//    {
//        continue;
//    }
//}
//// بررسی اینکه اگر باقیمانده برابر صفر شد، یعنی عدد مذکور مقسوم علیه درستی بوده و در نتیجه داخل لبست دومی ریخته میشود
//for (int i = 1; i <= b; i++)
//{
//    if (b % i == 0)
//    {
//        resultB.Add(i);
//    }
//    else
//    {
//        continue;
//    }
//}

//// تعریف لیست سوم برای بررسی مقسوم علیه های مشترکات بین دو عدد
//List<int> resultC = new List<int>();

//// بررسی اینکه اگر چندتا مقسوم علیه مشترک وجود داشت، بریزه توی لیست سوم
//foreach (int i in resultA)
//{   
//    foreach (int j in resultB)
//    {
//        if (i == j )
//        {
//            resultC.Add(i);
//        }
//    }
//}

//// بدست آوردن ب م م بین دو عدد
//Console.WriteLine(resultC.Max());

//****************************************************************************************

//string[] input = Console.ReadLine().Split();
//int a = int.Parse(input[0]);
//int b = int.Parse(input[1]);

//while (b != 0)
//{
//    int temp = b;
//    b = a % b;
//    a = temp;
//}

//Console.WriteLine(a);

//****************************************************************************************
//int n = int.Parse(Console.ReadLine());

//List<int> maghsoom = new List<int>();

//// اضافه کردن مقسوم علیه های یک عدد به لیست تعریف شده 
//for (int i = 1;  i < n; i++)
//{
//    if (n % i == 0)
//    {
//        maghsoom.Add(i);
//    }
//}

//// در صورتیکه مجموع مقسوم علیه های یک عدد برابر با خود عدد باشد، آن عدد کامل میباشد
//if (maghsoom.Sum() == n)
//{
//    Console.WriteLine("YES");
//}
//else if (maghsoom.Sum() != n)
//{
//    Console.WriteLine("NO");
//}

//****************************************************************************************
//int a = int.Parse(Console.ReadLine());
//int sum = 0;

//for (int i = 1; i < a; i++)
//{
//    if (a % i == 0)
//        sum += i;
//}

//// چون فقط و فقط یک کار قراره انجام بشه، در نتیجه آکولاداشو میتونیم نزاریم
//if (sum == a)
//    Console.WriteLine("YES");
//else
//    Console.WriteLine("NO");

//****************************************************************************************
//for (int i = 1; i < 11; i++)
//{
//    for (int j = 1; j < 11; j++)
//        Console.Write(i * j + " ");
//    Console.Write("\n");
//}

//****************************************************************************************
//// جدول ضرب جادویی
//for (int i = 1; i < 11; i++)
//{
//    for (int j = 1; j < 11; j++)
//        if (i == j)         // اگر شماره سطر و شماره ستون برابر باشند
//        {
//            Console.Write(0 + " ");
//        }
//        else if (i < j)     // شماره سطر کوچکتر از شماره ستون
//        {
//            Console.Write((-(i * j)) + " ");
//        }
//        else
//        {
//            Console.Write((i * j) + " ");       // شماره سطر بزرگتر از شماره ستون
//        }
        
//    Console.Write("\n");
//}

//****************************************************************************************
